backend/artillery-shelters-full.yml
config:
  target: "http://localhost:5000"

  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"

    - duration: 120
      arrivalRate: 20
      name: "Peak load"

    - duration: 60
      arrivalRate: 20
      rampTo: 80
      name: "Stress ramp"

  payload:
    path: "shelters.csv"
    fields:
      - shelterId

  ensure:
    maxErrorRate: 5        
    p95: 500               

scenarios:
  - name: "Normal user journey"
    weight: 6
    flow:
      - get:
          url: "/api/shelters"
          expect:
            - statusCode: 200

      - think: 2

      - get:
          url: "/api/shelters/{{ shelterId }}"
          expect:
            - statusCode: 200

      - think: 2

      - get:
          url: "/api/shelter-occupancy/{{ shelterId }}"
          expect:
            - statusCode: 200

  - name: "Operational update"
    weight: 2
    flow:
      - put:
          url: "/api/shelters/{{ shelterId }}/status"
          json:
            status: "OPEN"
          expect:
            - statusCode: 200

      - think: 1

      - put:
          url: "/api/shelter-occupancy/{{ shelterId }}"
          json:
            currentOccupancy: "{{ $randomNumber(50,300) }}"
          expect:
            - statusCode: 200

  - name: "Relief management"
    weight: 1
    flow:
      - post:
          url: "/api/shelters/{{ shelterId }}/items"
          json:
            name: "Rice"
            quantity: "{{ $randomNumber(10,200) }}"
            unit: "kg"
          expect:
            - statusCode: 200

      - think: 1

      - delete:
          url: "/api/shelters/{{ shelterId }}/items/Rice"
          expect:
            - statusCode: 200

  - name: "Shelter creation"
    weight: 1
    flow:
      - post:
          url: "/api/shelters"
          json:
            name: "Perf Shelter {{ $randomNumber(1000,9999) }}"
            district: "Colombo"
            capacity: "{{ $randomNumber(100,500) }}"
            managerName: "Perf Bot"
          expect:
            - statusCode: 201